create_clock -period 6.8 clk
set_input_delay 1 -clock clk [get_ports {*}]
set_output_delay 1 -clock clk [get_ports {*}]


set_pin_loc clk Bank_H_1_1
set_pin_loc a[0] Bank_H_1_2
set_pin_loc a[1] Bank_H_1_3
set_pin_loc a[2] Bank_H_1_4
set_pin_loc a[3] Bank_H_1_5
set_pin_loc a[4] Bank_H_1_6
set_pin_loc a[5] Bank_H_1_7
set_pin_loc a[6] Bank_H_1_8
set_pin_loc a[7] Bank_H_1_9
set_pin_loc a[8] Bank_H_1_10
set_pin_loc a[9] Bank_H_1_11
set_pin_loc a[10] Bank_H_1_12
set_pin_loc a[11] Bank_H_1_13
set_pin_loc a[12] Bank_H_1_14
set_pin_loc a[13] Bank_H_1_15
set_pin_loc a[14] Bank_H_1_16
set_pin_loc a[15] Bank_H_1_17
set_pin_loc a[16] Bank_H_1_18
set_pin_loc a[17] Bank_H_1_19
set_pin_loc a[18] Bank_H_1_20
set_pin_loc a[19] Bank_H_2_1
set_pin_loc b[0] Bank_H_2_2
set_pin_loc b[1]Bank_H_2_3
set_pin_loc b[2]Bank_H_2_4
set_pin_loc b[3]Bank_H_2_5
set_pin_loc b[4]Bank_H_2_6
set_pin_loc b[5]Bank_H_2_7
set_pin_loc b[6]Bank_H_2_8
set_pin_loc b[7]Bank_H_2_9
set_pin_loc b[8]Bank_H_2_10
set_pin_loc b[9]Bank_H_2_11
set_pin_loc b[10] Bank_H_2_12
set_pin_loc b[11] Bank_H_2_13
set_pin_loc b[12] Bank_H_2_14
set_pin_loc b[13] Bank_H_2_15
set_pin_loc b[14] Bank_H_2_16
set_pin_loc b[15] Bank_H_2_17
set_pin_loc b[16] Bank_H_2_18
set_pin_loc b[17] Bank_H_2_19
set_pin_loc feedback_in[0] Bank_H_2_20
set_pin_loc feedback_in[1] Bank_H_3_1
set_pin_loc feedback_in[2] Bank_H_3_2
set_pin_loc z_out Bank_H_3_3